package Storyline;

public class Opening {
    public static void opening() {

        System.out.println("\n\n             █     █░▓█████  ██▓     ▄████▄   ▒█████   ███▄ ▄███▓▓█████    ▄▄▄█████▓ ██▀███   ▄▄▄    ██▒   █▓▓█████  ██▓    ▓█████  ██▀███         ");
        System.out.println("             ▓█░ █ ░█░▓█   ▀ ▓██▒    ▒██▀ ▀█  ▒██▒  ██▒▓██▒▀█▀ ██▒▓█   ▀    ▓  ██▒ ▓▒▓██ ▒ ██▒▒████▄ ▓██░   █▒▓█   ▀ ▓██▒    ▓█   ▀ ▓██ ▒ ██▒      ");
        System.out.println("             ▒█░ █ ░█ ▒███   ▒██░    ▒▓█    ▄ ▒██░  ██▒▓██    ▓██░▒███      ▒ ▓██░ ▒░▓██ ░▄█ ▒▒██  ▀█▄▓██  █▒░▒███   ▒██░    ▒███   ▓██ ░▄█ ▒      ");
        System.out.println("             ░█░ █ ░█ ▒▓█  ▄ ▒██░    ▒▓▓▄ ▄██▒▒██   ██░▒██    ▒██ ▒▓█  ▄    ░ ▓██▓ ░ ▒██▀▀█▄  ░██▄▄▄▄██▒██ █░░▒▓█  ▄ ▒██░    ▒▓█  ▄ ▒██▀▀█▄        ");
        System.out.println("             ░░██▒██▓ ░▒████▒░██████▒▒ ▓███▀ ░░ ████▓▒░▒██▒   ░██▒░▒████▒     ▒██▒ ░ ░██▓ ▒██▒ ▓█   ▓██▒▒▀█░  ░▒████▒░██████▒░▒████▒░██▓ ▒██▒      ");
        System.out.println("             ░ ▓░▒ ▒  ░░ ▒░ ░░ ▒░▓  ░░ ░▒ ▒  ░░ ▒░▒░▒░ ░ ▒░   ░  ░░░ ▒░ ░     ▒ ░░   ░ ▒▓ ░▒▓░ ▒▒   ▓▒█░░ ▐░  ░░ ▒░ ░░ ▒░▓  ░░░ ▒░ ░░ ▒▓ ░▒▓░      ");
        System.out.println("               ▒ ░ ░   ░ ░  ░░ ░ ▒  ░  ░  ▒     ░ ▒ ▒░ ░  ░      ░ ░ ░  ░       ░      ░▒ ░ ▒░  ▒   ▒▒ ░░ ░░   ░ ░  ░░ ░ ▒  ░ ░ ░  ░  ░▒ ░ ▒░      ");
        System.out.println("               ░   ░     ░     ░ ░   ░        ░ ░ ░ ▒  ░      ░      ░        ░        ░░   ░   ░   ▒     ░░     ░     ░ ░      ░     ░░   ░       ");
        System.out.println("              ░       ░  ░    ░  ░░ ░          ░ ░           ░      ░  ░               ░           ░  ░   ░     ░  ░    ░  ░   ░  ░   ░           ");
        System.out.println("                          ░                                                                    ░                                           ");
        System.out.println("           ▄▄▄█████▓ ▒█████           ██████  ▄▄▄       ██▓    ▄▄▄       ███▄ ▄███▓ ██▓ ███▄    █   ▄████     ██▓     ██▓ ██░ ██  ██▓ ███▄ ▄███▓   ");
        System.out.println("           ▓  ██▒ ▓▒▒██▒  ██▒       ▒██    ▒ ▒████▄    ▓██▒   ▒████▄    ▓██▒▀█▀ ██▒▓██▒ ██ ▀█   █  ██▒ ▀█▒   ▓██▒    ▓██▒▓██░ ██▒▓██▒▓██▒▀█▀ ██▒   ");
        System.out.println("           ▒ ▓██░ ▒░▒██░  ██▒       ░ ▓██▄   ▒██  ▀█▄  ▒██░   ▒██  ▀█▄  ▓██    ▓██░▒██▒▓██  ▀█ ██▒▒██░▄▄▄░   ▒██░    ▒██▒▒██▀▀██░▒██▒▓██     ▓██░  ");
        System.out.println("           ░ ▓██▓ ░ ▒██   ██░         ▒   ██▒░██▄▄▄▄██ ▒██░   ░██▄▄▄▄██ ▒██    ▒██ ░██░▓██▒  ▐▌██▒░▓█  ██▓   ▒██░    ░██░░▓█ ░██ ░██░▒██     ▒██   ");
        System.out.println("             ▒██▒ ░ ░ ████▓▒░       ▒██████▒▒ ▓█   ▓██▒░██████▒▓█   ▓██▒▒██▒   ░██▒░██░▒██░   ▓██░░▒▓███▀▒   ░██████▒░██░░▓█▒░██▓░██░▒██▒    ░██▒  ");
        System.out.println("            ▒ ░░   ░ ▒░▒░▒░         ============================================================================================================   ");
        System.out.println("              ░      ░ ▒ ▒░         ░ ░▒  ░ ░  ▒   ▒▒ ░░ ░ ▒  ░ ▒   ▒▒ ░░  ░      ░ ▒ ░░ ░░   ░ ▒░  ░   ░    ░ ░ ▒  ░ ▒ ░ ▒ ░▒░ ░ ▒ ░░  ░      ░   ");
        System.out.println("            ░      ░ ░ ░ ▒          ░  ░  ░    ░   ▒     ░ ░    ░   ▒   ░      ░    ▒ ░   ░   ░ ░ ░ ░   ░      ░ ░    ▒ ░ ░  ░░ ░ ▒ ░░      ░      ");
        System.out.println("                     ░ ░           ░        ░  ░    ░  ░     ░  ░       ░    ░           ░       ░        ░  ░ ░   ░  ░  ░ ░         ░             ");
        System.out.println("                                                                                                                                           ");
        System.out.println("                                                   ~------~ WHERE MYTHS BREATHE, AND SHADOWS MOVE ~------~                                      ");
        System.out.println("                                                       ~------~ IN A MYSTERIOUS HIDDEN REALM ~------~                                          ");
        System.out.println();

        System.out.println("Prepare yourself -- your journey begins now!");
        DialogueUtils.pause();

        System.out.println("      +================================================================================================================================================+\n");
        System.out.println("                                                .0|'''.|                                             ||         ");
        System.out.println("                                                 ||..  '  .... ... .. ...     ...   ... ...   ....  ...   ....  ");
        System.out.println("                                                  ''|||.   '|.  |   ||  ||  .|  '|.  ||'  || ||. '   ||  ||. '  ");
        System.out.println("                                                .     '||   '|.|    ||  ||  ||   ||  ||    | . '|..  ||  . '|.. ");
        System.out.println("                                                |'....|'     '|    .||. ||.  '|..|'  ||...'  |'..|' .||. |'..|' ");
        System.out.println("                                                          .. |                       ||                         ");
        System.out.println("                                                           ''                       ''''                        ");
        System.out.println("                                         > >    ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' '    < <");
        System.out.println();
        System.out.println("                      Hidden between the lull of civilization and the thick mountains of the countryside lies a place of wonder and mystique.");
        System.out.println("                               A shining metropolis glittering with so much gold and riches you could hardly believe it exists.");
        System.out.println();
        System.out.println("                              This mystical place is BIRINGAN CITY, a melting pot of creatures once thought to be only folklore.");
        System.out.println("                                            Great lumbering Kapres and screeching Manananggals roam the streets.");
        System.out.println();
        System.out.println("                                                  But in this once peaceful city, TROUBLE BEGINS TO BREW.");
        System.out.println("                              The Babaylans seek to take control of all mythical creatures, and bring Biringan City to its knees.");
        System.out.println();
        System.out.println("                                                    Amidst the chaos, a spark of JUSTICE is awakened.");
        System.out.println("                                                           Out of the ashes... A HERO APPEARS.");
        System.out.println();
        System.out.println("      +================================================================================================================================================+");
        DialogueUtils.pause();
    }
}
