package Storyline.World1;

import Core.PlayerCharacter;
import Storyline.DialogueUtils;

import java.util.Scanner;

public class Mission1 {
    public static void mission1(PlayerCharacter player) {
        Scanner scan = new Scanner(System.in);

        System.out.println();
        System.out.println("              ================================================================================================================================");
        System.out.println("              ░░░▀▄░░▀▄░░█▄█░▀█▀░█▀▀░█▀▀░▀█▀░█▀█░█▀█░░░▀█░░░░░░░░▀█▀░█░█░█▀▀░░░█░█░█▀▀░█▀█░█▀▄░▀█▀░░░█▀█░█▀▀░░░█▀█░░░█░█░█▀▀░█▀▄░█▀█░░░░▄▀░░▄▀");
        System.out.println("              ░░░░▄▀░░▄▀░█░█░░█░░▀▀█░▀▀█░░█░░█░█░█░█░░░░█░░░▀░░░░░█░░█▀█░█▀▀░░░█▀█░█▀▀░█▀█░█▀▄░░█░░░░█░█░█▀▀░░░█▀█░░░█▀█░█▀▀░█▀▄░█░█░░░▀▄░░▀▄░");
        System.out.println("              ░░░▀░░░▀░░░▀░▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀░▀░░░▀▀▀░░▀░░░░░▀░░▀░▀░▀▀▀░░░▀░▀░▀▀▀░▀░▀░▀░▀░░▀░░░░▀▀▀░▀░░░░░▀░▀░░░▀░▀░▀▀▀░▀░▀░▀▀▀░░░░░▀░░░▀");
        System.out.println("              ================================================================================================================================\n");
        scan.nextLine();
        System.out.println("???: Someone help! Please! A thief has stolen my merchandise!");
        scan.nextLine();

        System.out.println("You find the source of the scream and, without even taking a second to think about it, you bolt after five duwendes clearly trying to make a run for it.\n");
        scan.nextLine();

        System.out.println("[You encountered 3 duwendes. Choose a target and an attack]");
        System.out.println();
        DialogueUtils.pause();
    }
}
